---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.BadReferenceBetweenOptionsWarn
source: html/c8af7ea2-e5d8-6426-a093-09143afa080e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.BadReferenceBetweenOptionsWarn Property

An element may not reference an element in another Option of the same Option Set.

## Syntax (C#)
```csharp
public static FailureDefinitionId BadReferenceBetweenOptionsWarn { get; }
```